"""存储全国各个城市的景区与美食(不用录入), 在控制台中显示出来
北京:
景区: 故宫，天安门, 天坛
美食: 烤鸭, 炸酱面,豆汁, 卤煮.
四川:
景区: 九寨沟, 峨眉山, 春熙路
美食: 火锅, 串串香，兔头。
"""
"""
dict01 = {
    "北京”:
        {
            "景区": ["故宫","天安门","天坛"],
            "美食": ["烤鸭","卤煮","炸酱面","豆汁"]
        },
    "四川":
        {
            "景区": ["九寨沟"","春熙路","峨眉山"],
            "美食": ["火锅","串串香","兔头”]
        }
}
"""
list02 = []
# 遍历大字典，获取的是地区
for key in dict01:
    # 遍历景区列表
    for item in dicto1[key]["景区"]:
    # 地区+景区
        list02.append(key + ":" + item)
print(list02)
